#### Terraform Format and Style 🖌`success`
#### Terraform Initialization ⚙️`success`
#### Terraform Validation 🤖`success`
<details><summary>Validation Output</summary>

```

Success! The configuration is valid.


```

</details>

#### Terraform Plan 📖`success`

<details><summary>Show Plan</summary>

```

terraform
data.aws_caller_identity.current: Reading...
module.eks.data.aws_caller_identity.current[0]: Reading...
module.eks.module.eks_managed_node_group["default"].data.aws_iam_policy_document.assume_role_policy[0]: Reading...
module.eks.module.eks_managed_node_group["default"].data.aws_caller_identity.current: Reading...
module.eks.module.kms.data.aws_caller_identity.current[0]: Reading...
data.aws_iam_policy_document.aws_ebs_csi_driver_assume_role_document: Reading...
module.eks.module.eks_managed_node_group["default"].data.aws_partition.current: Reading...
module.eks.data.aws_partition.current[0]: Reading...
module.eks.data.aws_iam_policy_document.assume_role_policy[0]: Reading...
module.vpc.aws_vpc.this[0]: Refreshing state... [id=vpc-0ce674b58c497dee8]
module.eks.data.aws_iam_policy_document.assume_role_policy[0]: Read complete after 0s [id=2830595799]
module.eks.data.aws_partition.current[0]: Read complete after 0s [id=aws]
module.eks.module.eks_managed_node_group["default"].data.aws_partition.current: Read complete after 0s [id=aws]
module.eks.module.kms.data.aws_partition.current[0]: Reading...
data.aws_iam_policy_document.aws_ebs_csi_driver_assume_role_document: Read complete after 0s [id=819195744]
module.eks.module.eks_managed_node_group["default"].data.aws_iam_policy_document.assume_role_policy[0]: Read complete after 0s [id=2560088296]
module.eks.module.kms.data.aws_partition.current[0]: Read complete after 0s [id=aws]
module.eks.aws_cloudwatch_log_group.this[0]: Refreshing state... [id=/aws/eks/common-eks/cluster]
aws_iam_role.aws_ebs_csi_driver_assume_role: Refreshing state... [id=AmazonEBSCSIDriverRole]
module.eks.aws_iam_role.this[0]: Refreshing state... [id=common-eks-cluster-20241226043235471800000001]
module.eks.module.eks_managed_node_group["default"].aws_iam_role.this[0]: Refreshing state... [id=default-eks-node-group-20241226053858064200000001]
module.eks.data.aws_iam_policy_document.custom[0]: Reading...
module.eks.data.aws_iam_policy_document.custom[0]: Read complete after 0s [id=513122117]
module.eks.aws_iam_policy.custom[0]: Refreshing state... [id=arn:aws:iam::183631350996:policy/common-eks-cluster-20241226043235471900000002]
module.eks.module.kms.data.aws_caller_identity.current[0]: Read complete after 0s [id=183631350996]
data.aws_caller_identity.current: Read complete after 0s [id=183631350996]
module.eks.module.eks_managed_node_group["default"].data.aws_caller_identity.current: Read complete after 0s [id=183631350996]
module.eks.data.aws_caller_identity.current[0]: Read complete after 0s [id=183631350996]
module.eks.data.aws_iam_session_context.current[0]: Reading...
module.eks.data.aws_iam_session_context.current[0]: Read complete after 0s [id=arn:aws:sts::183631350996:assumed-role/IaC-ReadOnly/GitHubActions]
aws_iam_role_policy_attachment.test-attach: Refreshing state... [id=AmazonEBSCSIDriverRole-20241226043236301000000007]
module.eks.aws_iam_role_policy_attachment.custom[0]: Refreshing state... [id=common-eks-cluster-20241226043235471800000001-20241226043236249400000004]
module.eks.aws_iam_role_policy_attachment.this["AmazonEKSVPCResourceController"]: Refreshing state... [id=common-eks-cluster-20241226043235471800000001-20241226043236260500000005]
module.eks.aws_iam_role_policy_attachment.this["AmazonEKSClusterPolicy"]: Refreshing state... [id=common-eks-cluster-20241226043235471800000001-20241226043236265200000006]
module.eks.module.kms.data.aws_iam_policy_document.this[0]: Reading...
module.eks.module.kms.data.aws_iam_policy_document.this[0]: Read complete after 0s [id=3557718324]
module.eks.module.kms.aws_kms_key.this[0]: Refreshing state... [id=02e10580-78ff-4a65-be74-445b1cf24ce2]
module.eks.module.eks_managed_node_group["default"].aws_iam_role_policy_attachment.this["AmazonEKSWorkerNodePolicy"]: Refreshing state... [id=default-eks-node-group-20241226053858064200000001-20241226053858451400000003]
module.eks.module.eks_managed_node_group["default"].aws_iam_role_policy_attachment.this["AmazonEKS_CNI_Policy"]: Refreshing state... [id=default-eks-node-group-20241226053858064200000001-20241226053858433500000002]
module.eks.module.eks_managed_node_group["default"].aws_iam_role_policy_attachment.this["AmazonEC2ContainerRegistryReadOnly"]: Refreshing state... [id=default-eks-node-group-20241226053858064200000001-20241226053858526400000004]
module.eks.module.kms.aws_kms_alias.this["cluster"]: Refreshing state... [id=alias/eks/common-eks]
module.eks.aws_iam_policy.cluster_encryption[0]: Refreshing state... [id=arn:aws:iam::183631350996:policy/common-eks-cluster-ClusterEncryption20241226043257827400000010]
module.vpc.aws_default_route_table.default[0]: Refreshing state... [id=rtb-0cb890f09324d2b37]
module.eks.aws_security_group.cluster[0]: Refreshing state... [id=sg-0bca477b56b1140b5]
module.vpc.aws_default_security_group.this[0]: Refreshing state... [id=sg-0491d2e797e744cc1]
module.vpc.aws_subnet.private[0]: Refreshing state... [id=subnet-0067559a5263fe9ac]
module.vpc.aws_subnet.private[1]: Refreshing state... [id=subnet-06b3841968e507322]
module.vpc.aws_subnet.private[2]: Refreshing state... [id=subnet-0fcb83086061aa8e3]
module.vpc.aws_internet_gateway.this[0]: Refreshing state... [id=igw-0cadcda90cbdf4cfd]
module.vpc.aws_subnet.public[2]: Refreshing state... [id=subnet-041156176234b4197]
module.eks.aws_security_group.node[0]: Refreshing state... [id=sg-00ecb231aa6794c77]
module.vpc.aws_subnet.public[0]: Refreshing state... [id=subnet-0f2278c72fcc298ec]
module.vpc.aws_subnet.public[1]: Refreshing state... [id=subnet-0b02077f46ea8729a]
module.vpc.aws_default_network_acl.this[0]: Refreshing state... [id=acl-0ef9476176f5c8ff1]
module.vpc.aws_route_table.private[0]: Refreshing state... [id=rtb-0d17e8f8b96365daf]
module.vpc.aws_route_table.public[0]: Refreshing state... [id=rtb-08aab78b96bd0a4c5]
module.eks.aws_iam_role_policy_attachment.cluster_encryption[0]: Refreshing state... [id=common-eks-cluster-20241226043235471800000001-20241226043258306500000011]
module.vpc.aws_eip.nat[0]: Refreshing state... [id=eipalloc-015bc539454911e9c]
module.eks.aws_security_group_rule.node["ingress_cluster_9443_webhook"]: Refreshing state... [id=sgrule-3493421729]
module.eks.aws_security_group_rule.node["ingress_cluster_4443_webhook"]: Refreshing state... [id=sgrule-1854278365]
module.eks.aws_security_group_rule.node["egress_all"]: Refreshing state... [id=sgrule-686673597]
module.eks.aws_security_group_rule.node["ingress_nodes_ephemeral"]: Refreshing state... [id=sgrule-19993364]
module.eks.aws_security_group_rule.node["ingress_cluster_kubelet"]: Refreshing state... [id=sgrule-1843017391]
module.eks.aws_security_group_rule.node["ingress_cluster_6443_webhook"]: Refreshing state... [id=sgrule-2814668107]
module.eks.aws_security_group_rule.node["ingress_self_coredns_tcp"]: Refreshing state... [id=sgrule-844468187]
module.eks.aws_security_group_rule.node["ingress_cluster_443"]: Refreshing state... [id=sgrule-685174604]
module.eks.aws_security_group_rule.node["ingress_self_coredns_udp"]: Refreshing state... [id=sgrule-2517249076]
module.eks.aws_security_group_rule.cluster["ingress_nodes_443"]: Refreshing state... [id=sgrule-1205543513]
module.eks.aws_security_group_rule.node["ingress_cluster_8443_webhook"]: Refreshing state... [id=sgrule-3029881194]
module.vpc.aws_route_table_association.public[0]: Refreshing state... [id=rtbassoc-0c4389e3eadf2a29e]
module.vpc.aws_route.public_internet_gateway[0]: Refreshing state... [id=r-rtb-08aab78b96bd0a4c51080289494]
module.vpc.aws_route_table_association.public[1]: Refreshing state... [id=rtbassoc-0bfb21ab27774bb3c]
module.vpc.aws_route_table_association.public[2]: Refreshing state... [id=rtbassoc-03a48fdf594dc4cd2]
module.vpc.aws_route_table_association.private[0]: Refreshing state... [id=rtbassoc-095a0b1384b760a3b]
module.vpc.aws_route_table_association.private[1]: Refreshing state... [id=rtbassoc-09b88f1672e964b49]
module.vpc.aws_route_table_association.private[2]: Refreshing state... [id=rtbassoc-0e6ee82ecf20c3185]
module.vpc.aws_nat_gateway.this[0]: Refreshing state... [id=nat-0097f88b5c6785e33]
module.vpc.aws_route.private_nat_gateway[0]: Refreshing state... [id=r-rtb-0d17e8f8b96365daf1080289494]
module.eks.aws_eks_cluster.this[0]: Refreshing state... [id=common-eks]
module.eks.aws_eks_access_entry.this["github_action_ci_read_only"]: Refreshing state... [id=common-eks:arn:aws:iam::183631350996:role/IaC-ReadOnly]
module.eks.aws_eks_access_entry.this["github_action_ci"]: Refreshing state... [id=common-eks:arn:aws:iam::183631350996:role/IaC]
module.eks.aws_eks_access_entry.this["root_user"]: Refreshing state... [id=common-eks:arn:aws:iam::183631350996:root]
module.eks.time_sleep.this[0]: Refreshing state... [id=2024-12-26T04:44:58Z]
module.eks.data.aws_eks_addon_version.this["vpc-cni"]: Reading...
module.eks.data.aws_eks_addon_version.this["aws-ebs-csi-driver"]: Reading...
module.eks.data.aws_eks_addon_version.this["coredns"]: Reading...
module.eks.data.aws_eks_addon_version.this["eks-pod-identity-agent"]: Reading...
module.eks.data.tls_certificate.this[0]: Reading...
module.eks.data.aws_eks_addon_version.this["kube-proxy"]: Reading...
module.eks.module.eks_managed_node_group["default"].module.user_data.null_resource.validate_cluster_service_cidr: Refreshing state... [id=5802554092292871677]
module.eks.module.eks_managed_node_group["default"].aws_launch_template.this[0]: Refreshing state... [id=lt-069dd07b3dda44f56]
module.eks.data.aws_eks_addon_version.this["aws-ebs-csi-driver"]: Read complete after 0s [id=aws-ebs-csi-driver]
module.eks.data.aws_eks_addon_version.this["eks-pod-identity-agent"]: Read complete after 0s [id=eks-pod-identity-agent]
module.eks.data.aws_eks_addon_version.this["coredns"]: Read complete after 0s [id=coredns]
module.eks.data.tls_certificate.this[0]: Read complete after 0s [id=99d41e43229a4cdaf4141f3e8310e6d95c31dab9]
module.eks.aws_iam_openid_connect_provider.oidc_provider[0]: Refreshing state... [id=arn:aws:iam::183631350996:oidc-provider/oidc.eks.us-east-1.amazonaws.com/id/647A0EE066A5603AB6D3A73F267FCF1C]
module.eks.module.eks_managed_node_group["default"].aws_eks_node_group.this[0]: Refreshing state... [id=common-eks:default-20241226053904092100000007]
module.eks.data.aws_eks_addon_version.this["kube-proxy"]: Read complete after 0s [id=kube-proxy]
module.eks.data.aws_eks_addon_version.this["vpc-cni"]: Read complete after 0s [id=vpc-cni]
module.eks.aws_eks_access_policy_association.this["github_action_ci_read_only_github_action_ci_read_only"]: Refreshing state... [id=common-eks#arn:aws:iam::183631350996:role/IaC-ReadOnly#arn:aws:eks::aws:cluster-access-policy/AmazonEKSAdminViewPolicy]
module.eks.aws_eks_access_policy_association.this["root_user_root_user"]: Refreshing state... [id=common-eks#arn:aws:iam::183631350996:root#arn:aws:eks::aws:cluster-access-policy/AmazonEKSClusterAdminPolicy]
module.eks.aws_eks_access_policy_association.this["github_action_ci_github_action_ci"]: Refreshing state... [id=common-eks#arn:aws:iam::183631350996:role/IaC#arn:aws:eks::aws:cluster-access-policy/AmazonEKSClusterAdminPolicy]
module.eks.aws_eks_addon.this["kube-proxy"]: Refreshing state... [id=common-eks:kube-proxy]
module.eks.aws_eks_addon.this["vpc-cni"]: Refreshing state... [id=common-eks:vpc-cni]
module.eks.aws_eks_addon.this["coredns"]: Refreshing state... [id=common-eks:coredns]
module.eks.aws_eks_addon.this["aws-ebs-csi-driver"]: Refreshing state... [id=common-eks:aws-ebs-csi-driver]
module.eks.aws_eks_addon.this["eks-pod-identity-agent"]: Refreshing state... [id=common-eks:eks-pod-identity-agent]
data.aws_eks_cluster.eks: Reading...
data.aws_eks_cluster.eks: Read complete after 1s [id=common-eks]
helm_release.strimzi_kafka_operator: Refreshing state... [id=strimzi-operator]
helm_release.metrics_server: Refreshing state... [id=metrics-server]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  ~ update in-place

Terraform will perform the following actions:

  # kubernetes_manifest.kafka_debezium_cluster will be created
  + resource "kubernetes_manifest" "kafka_debezium_cluster" {
      + manifest = {
          + apiVersion = "kafka.strimzi.io/v1beta2"
          + kind       = "Kafka"
          + metadata   = {
              + name      = "kafka"
              + namespace = "kafka"
            }
          + spec       = {
              + entityOperator = {
                  + topicOperator = {}
                  + userOperator  = {}
                }
              + kafka          = {
                  + config    = {
                      + "default.replication.factor"               = 1
                      + "min.insync.replicas"                      = 1
                      + "offsets.topic.replication.factor"         = 1
                      + "transaction.state.log.min.isr"            = 1
                      + "transaction.state.log.replication.factor" = 1
                    }
                  + listeners = [
                      + {
                          + name = "plain"
                          + port = 9092
                          + tls  = false
                          + type = "internal"
                        },
                      + {
                          + authentication = {
                              + type = "tls"
                            }
                          + name           = "tls"
                          + port           = 9093
                          + tls            = true
                          + type           = "internal"
                        },
                      + {
                          + name = "external"
                          + port = 9094
                          + tls  = false
                          + type = "nodeport"
                        },
                    ]
                  + replicas  = 1
                  + storage   = {
                      + type    = "jbod"
                      + volumes = [
                          + {
                              + deleteClaim = false
                              + id          = 0
                              + size        = "8Gi"
                              + type        = "persistent-claim"
                            },
                        ]
                    }
                }
              + zookeeper      = {
                  + replicas = 1
                  + storage  = {
                      + deleteClaim = false
                      + size        = "8Gi"
                      + type        = "persistent-claim"
                    }
                }
            }
        }
      + object   = {
          + apiVersion = "kafka.strimzi.io/v1beta2"
          + kind       = "Kafka"
          + metadata   = {
              + annotations                = (known after apply)
              + creationTimestamp          = (known after apply)
              + deletionGracePeriodSeconds = (known after apply)
              + deletionTimestamp          = (known after apply)
              + finalizers                 = (known after apply)
              + generateName               = (known after apply)
              + generation                 = (known after apply)
              + labels                     = (known after apply)
              + managedFields              = (known after apply)
              + name                       = "kafka"
              + namespace                  = "kafka"
              + ownerReferences            = (known after apply)
              + resourceVersion            = (known after apply)
              + selfLink                   = (known after apply)
              + uid                        = (known after apply)
            }
          + spec       = {
              + clientsCa              = {
                  + certificateExpirationPolicy  = (known after apply)
                  + generateCertificateAuthority = (known after apply)
                  + generateSecretOwnerReference = (known after apply)
                  + renewalDays                  = (known after apply)
                  + validityDays                 = (known after apply)
                }
              + clusterCa              = {
                  + certificateExpirationPolicy  = (known after apply)
                  + generateCertificateAuthority = (known after apply)
                  + generateSecretOwnerReference = (known after apply)
                  + renewalDays                  = (known after apply)
                  + validityDays                 = (known after apply)
                }
              + cruiseControl          = {
                  + apiUsers       = {
                      + type      = (known after apply)
                      + valueFrom = {
                          + secretKeyRef = {
                              + key      = (known after apply)
                              + name     = (known after apply)
                              + optional = (known after apply)
                            }
                        }
                    }
                  + autoRebalance  = (known after apply)
                  + brokerCapacity = {
                      + cpu             = (known after apply)
                      + cpuUtilization  = (known after apply)
                      + disk            = (known after apply)
                      + inboundNetwork  = (known after apply)
                      + outboundNetwork = (known after apply)
                      + overrides       = (known after apply)
                    }
                  + config         = (known after apply)
                  + image          = (known after apply)
                  + jvmOptions     = {
                      + "-XX"                = (known after apply)
                      + "-Xms"               = (known after apply)
                      + "-Xmx"               = (known after apply)
                      + gcLoggingEnabled     = (known after apply)
                      + javaSystemProperties = (known after apply)
                    }
                  + livenessProbe  = {
                      + failureThreshold    = (known after apply)
                      + initialDelaySeconds = (known after apply)
                      + periodSeconds       = (known after apply)
                      + successThreshold    = (known after apply)
                      + timeoutSeconds      = (known after apply)
                    }
                  + logging        = {
                      + loggers   = (known after apply)
                      + type      = (known after apply)
                      + valueFrom = {
                          + configMapKeyRef = {
                              + key      = (known after apply)
                              + name     = (known after apply)
                              + optional = (known after apply)
                            }
                        }
                    }
                  + metricsConfig  = {
                      + type      = (known after apply)
                      + valueFrom = {
                          + configMapKeyRef = {
                              + key      = (known after apply)
                              + name     = (known after apply)
                              + optional = (known after apply)
                            }
                        }
                    }
                  + readinessProbe = {
                      + failureThreshold    = (known after apply)
                      + initialDelaySeconds = (known after apply)
                      + periodSeconds       = (known after apply)
                      + successThreshold    = (known after apply)
                      + timeoutSeconds      = (known after apply)
                    }
                  + resources      = {
                      + claims   = (known after apply)
                      + limits   = (known after apply)
                      + requests = (known after apply)
                    }
                  + template       = {
                      + apiService             = {
                          + ipFamilies     = (known after apply)
                          + ipFamilyPolicy = (known after apply)
                          + metadata       = {
                              + annotations = (known after apply)
                              + labels      = (known after apply)
                            }
                        }
                      + cruiseControlContainer = {
                          + env             = (known after apply)
                          + securityContext = {
                              + allowPrivilegeEscalation = (known after apply)
                              + appArmorProfile          = {
                                  + localhostProfile = (known after apply)
                                  + type             = (known after apply)
                                }
                              + capabilities             = {
                                  + add  = (known after apply)
                                  + drop = (known after apply)
                                }
                              + privileged               = (known after apply)
                              + procMount                = (known after apply)
                              + readOnlyRootFilesystem   = (known after apply)
                              + runAsGroup               = (known after apply)
                              + runAsNonRoot             = (known after apply)
                              + runAsUser                = (known after apply)
                              + seLinuxOptions           = {
                                  + level = (known after apply)
                                  + role  = (known after apply)
                                  + type  = (known after apply)
                                  + user  = (known after apply)
                                }
                              + seccompProfile           = {
                                  + localhostProfile = (known after apply)
                                  + type             = (known after apply)
                                }
                              + windowsOptions           = {
                                  + gmsaCredentialSpec     = (known after apply)
                                  + gmsaCredentialSpecName = (known after apply)
                                  + hostProcess            = (known after apply)
                                  + runAsUserName          = (known after apply)
                                }
                            }
                          + volumeMounts    = (known after apply)
                        }
                      + deployment             = {
                          + deploymentStrategy = (known after apply)
                          + metadata           = {
                              + annotations = (known after apply)
                              + labels      = (known after apply)
                            }
                        }
                      + pod                    = {
                          + affinity                      = {
                              + nodeAffinity    = {
                                  + preferredDuringSchedulingIgnoredDuringExecution = (known after apply)
                                  + requiredDuringSchedulingIgnoredDuringExecution  = {
                                      + nodeSelectorTerms = (known after apply)
                                    }
                                }
                              + podAffinity     = {
                                  + preferredDuringSchedulingIgnoredDuringExecution = (known after apply)
                                  + requiredDuringSchedulingIgnoredDuringExecution  = (known after apply)
                                }
                              + podAntiAffinity = {
                                  + preferredDuringSchedulingIgnoredDuringExecution = (known after apply)
                                  + requiredDuringSchedulingIgnoredDuringExecution  = (known after apply)
                                }
                            }
                          + enableServiceLinks            = (known after apply)
                          + hostAliases                   = (known after apply)
                          + imagePullSecrets              = (known after apply)
                          + metadata                      = {
                              + annotations = (known after apply)
                              + labels      = (known after apply)
                            }
                          + priorityClassName             = (known after apply)
                          + schedulerName                 = (known after apply)
                          + securityContext               = {
                              + appArmorProfile     = {
                                  + localhostProfile = (known after apply)
                                  + type             = (known after apply)
                                }
                              + fsGroup             = (known after apply)
                              + fsGroupChangePolicy = (known after apply)
                              + runAsGroup          = (known after apply)
                              + runAsNonRoot        = (known after apply)
                              + runAsUser           = (known after apply)
                              + seLinuxOptions      = {
                                  + level = (known after apply)
                                  + role  = (known after apply)
                                  + type  = (known after apply)
                                  + user  = (known after apply)
                                }
                              + seccompProfile      = {
                                  + localhostProfile = (known after apply)
                                  + type             = (known after apply)
                                }
                              + supplementalGroups  = (known after apply)
                              + sysctls             = (known after apply)
                              + windowsOptions      = {
                                  + gmsaCredentialSpec     = (known after apply)
                                  + gmsaCredentialSpecName = (known after apply)
                                  + hostProcess            = (known after apply)
                                  + runAsUserName          = (known after apply)
                                }
                            }
                          + terminationGracePeriodSeconds = (known after apply)
                          + tmpDirSizeLimit               = (known after apply)
                          + tolerations                   = (known after apply)
                          + topologySpreadConstraints     = (known after apply)
                          + volumes                       = (known after apply)
                        }
                      + podDisruptionBudget    = {
                          + maxUnavailable = (known after apply)
                          + metadata       = {
                              + annotations = (known after apply)
                              + labels      = (known after apply)
                            }
                        }
                      + serviceAccount         = {
                          + metadata = {
                              + annotations = (known after apply)
                              + labels      = (known after apply)
                            }
                        }
                      + tlsSidecarContainer    = {
                          + env             = (known after apply)
                          + securityContext = {
                              + allowPrivilegeEscalation = (known after apply)
                              + appArmorProfile          = {
                                  + localhostProfile = (known after apply)
                                  + type             = (known after apply)
                                }
                              + capabilities             = {
                                  + add  = (known after apply)
                                  + drop = (known after apply)
                                }
                              + privileged               = (known after apply)
                              + procMount                = (known after apply)
                              + readOnlyRootFilesystem   = (known after apply)
                              + runAsGroup               = (known after apply)
                              + runAsNonRoot             = (known after apply)
                              + runAsUser                = (known after apply)
                              + seLinuxOptions           = {
                                  + level = (known after apply)
                                  + role  = (known after apply)
                                  + type  = (known after apply)
                                  + user  = (known after apply)
                                }
                              + seccompProfile           = {
                                  + localhostProfile = (known after apply)
                                  + type             = (known after apply)
                                }
                              + windowsOptions           = {
                                  + gmsaCredentialSpec     = (known after apply)
                                  + gmsaCredentialSpecName = (known after apply)
                                  + hostProcess            = (known after apply)
                                  + runAsUserName          = (known after apply)
                                }
                            }
                          + volumeMounts    = (known after apply)
                        }
                    }
                  + tlsSidecar     = {
                      + image          = (known after apply)
                      + livenessProbe  = {
                          + failureThreshold    = (known after apply)
                          + initialDelaySeconds = (known after apply)
                          + periodSeconds       = (known after apply)
                          + successThreshold    = (known after apply)
                          + timeoutSeconds      = (known after apply)
                        }
                      + logLevel       = (known after apply)
                      + readinessProbe = {
                          + failureThreshold    = (known after apply)
                          + initialDelaySeconds = (known after apply)
                          + periodSeconds       = (known after apply)
                          + successThreshold    = (known after apply)
                          + timeoutSeconds      = (known after apply)
                        }
                      + resources      = {
                          + claims   = (known after apply)
                          + limits   = (known after apply)
                          + requests = (known after apply)
                        }
                    }
                }
              + entityOperator         = {
                  + template      = {
                      + deployment               = {
                          + deploymentStrategy = (known after apply)
                          + metadata           = {
                              + annotations = (known after apply)
                              + labels      = (known after apply)
                            }
                        }
                      + entityOperatorRole       = {
                          + metadata = {
                              + annotations = (known after apply)
                              + labels      = (known after apply)
                            }
                        }
                      + pod                      = {
                          + affinity                      = {
                              + nodeAffinity    = {
                                  + preferredDuringSchedulingIgnoredDuringExecution = (known after apply)
                                  + requiredDuringSchedulingIgnoredDuringExecution  = {
                                      + nodeSelectorTerms = (known after apply)
                                    }
                                }
                              + podAffinity     = {
                                  + preferredDuringSchedulingIgnoredDuringExecution = (known after apply)
                                  + requiredDuringSchedulingIgnoredDuringExecution  = (known after apply)
                                }
                              + podAntiAffinity = {
                                  + preferredDuringSchedulingIgnoredDuringExecution = (known after apply)
                                  + requiredDuringSchedulingIgnoredDuringExecution  = (known after apply)
                                }
                            }
                          + enableServiceLinks            = (known after apply)
                          + hostAliases                   = (known after apply)
                          + imagePullSecrets              = (known after apply)
                          + metadata                      = {
                              + annotations = (known after apply)
                              + labels      = (known after apply)
                            }
                          + priorityClassName             = (known after apply)
                          + schedulerName                 = (known after apply)
                          + securityContext               = {
                              + appArmorProfile     = {
                                  + localhostProfile = (known after apply)
                                  + type             = (known after apply)
                                }
                              + fsGroup             = (known after apply)
                              + fsGroupChangePolicy = (known after apply)
                              + runAsGroup          = (known after apply)
                              + runAsNonRoot        = (known after apply)
                              + runAsUser           = (known after apply)
                              + seLinuxOptions      = {
                                  + level = (known after apply)
                                  + role  = (known after apply)
                                  + type  = (known after apply)
                                  + user  = (known after apply)
                                }
                              + seccompProfile      = {
                                  + localhostProfile = (known after apply)
                                  + type             = (known after apply)
                                }
                              + supplementalGroups  = (known after apply)
                              + sysctls             = (known after apply)
                              + windowsOptions      = {
                                  + gmsaCredentialSpec     = (known after apply)
                                  + gmsaCredentialSpecName = (known after apply)
                                  + hostProcess            = (known after apply)
                                  + runAsUserName          = (known after apply)
                                }
                            }
                          + terminationGracePeriodSeconds = (known after apply)
                          + tmpDirSizeLimit               = (known after apply)
                          + tolerations                   = (known after apply)
                          + topologySpreadConstraints     = (known after apply)
                          + volumes                       = (known after apply)
                        }
                      + serviceAccount           = {
                          + metadata = {
                              + annotations = (known after apply)
                              + labels      = (known after apply)
                            }
                        }
                      + tlsSidecarContainer      = {
                          + env             = (known after apply)
                          + securityContext = {
                              + allowPrivilegeEscalation = (known after apply)
                              + appArmorProfile          = {
                                  + localhostProfile = (known after apply)
                                  + type             = (known after apply)
                                }
                              + capabilities             = {
                                  + add  = (known after apply)
                                  + drop = (known after apply)
                                }
                              + privileged               = (known after apply)
                              + procMount                = (known after apply)
                              + readOnlyRootFilesystem   = (known after apply)
                              + runAsGroup               = (known after apply)
                              + runAsNonRoot             = (known after apply)
                              + runAsUser                = (known after apply)
                              + seLinuxOptions           = {
                                  + level = (known after apply)
                                  + role  = (known after apply)
                                  + type  = (known after apply)
                                  + user  = (known after apply)
                                }
                              + seccompProfile           = {
                                  + localhostProfile = (known after apply)
                                  + type             = (known after apply)
                                }
                              + windowsOptions           = {
                                  + gmsaCredentialSpec     = (known after apply)
                                  + gmsaCredentialSpecName = (known after apply)
                                  + hostProcess            = (known after apply)
                                  + runAsUserName          = (known after apply)
                                }
                            }
                          + volumeMounts    = (known after apply)
                        }
                      + topicOperatorContainer   = {
                          + env             = (known after apply)
                          + securityContext = {
                              + allowPrivilegeEscalation = (known after apply)
                              + appArmorProfile          = {
                                  + localhostProfile = (known after apply)
                                  + type             = (known after apply)
                                }
                              + capabilities             = {
                                  + add  = (known after apply)
                                  + drop = (known after apply)
                                }
                              + privileged               = (known after apply)
                              + procMount                = (known after apply)
                              + readOnlyRootFilesystem   = (known after apply)
                              + runAsGroup               = (known after apply)
                              + runAsNonRoot             = (known after apply)
                              + runAsUser                = (known after apply)
                              + seLinuxOptions           = {
                                  + level = (known after apply)
                                  + role  = (known after apply)
                                  + type  = (known after apply)
                                  + user  = (known after apply)
                                }
                              + seccompProfile           = {
                                  + localhostProfile = (known after apply)
                                  + type             = (known after apply)
                                }
                              + windowsOptions           = {
                                  + gmsaCredentialSpec     = (known after apply)
                                  + gmsaCredentialSpecName = (known after apply)
                                  + hostProcess            = (known after apply)
                                  + runAsUserName          = (known after apply)
                                }
                            }
                          + volumeMounts    = (known after apply)
                        }
                      + topicOperatorRoleBinding = {
                          + metadata = {
                              + annotations = (known after apply)
                              + labels      = (known after apply)
                            }
                        }
                      + userOperatorContainer    = {
                          + env             = (known after apply)
                          + securityContext = {
                              + allowPrivilegeEscalation = (known after apply)
                              + appArmorProfile          = {
                                  + localhostProfile = (known after apply)
                                  + type             = (known after apply)
                                }
                              + capabilities             = {
                                  + add  = (known after apply)
                                  + drop = (known after apply)
                                }
                              + privileged               = (known after apply)
                              + procMount                = (known after apply)
                              + readOnlyRootFilesystem   = (known after apply)
                              + runAsGroup               = (known after apply)
                              + runAsNonRoot             = (known after apply)
                              + runAsUser                = (known after apply)
                              + seLinuxOptions           = {
                                  + level = (known after apply)
                                  + role  = (known after apply)
                                  + type  = (known after apply)
                                  + user  = (known after apply)
                                }
                              + seccompProfile           = {
                                  + localhostProfile = (known after apply)
                                  + type             = (known after apply)
                                }
                              + windowsOptions           = {
                                  + gmsaCredentialSpec     = (known after apply)
                                  + gmsaCredentialSpecName = (known after apply)
                                  + hostProcess            = (known after apply)
                                  + runAsUserName          = (known after apply)
                                }
                            }
                          + volumeMounts    = (known after apply)
                        }
                      + userOperatorRoleBinding  = {
                          + metadata = {
                              + annotations = (known after apply)
                              + labels      = (known after apply)
                            }
                        }
                    }
                  + tlsSidecar    = {
                      + image          = (known after apply)
                      + livenessProbe  = {
                          + failureThreshold    = (known after apply)
                          + initialDelaySeconds = (known after apply)
                          + periodSeconds       = (known after apply)
                          + successThreshold    = (known after apply)
                          + timeoutSeconds      = (known after apply)
                        }
                      + logLevel       = (known after apply)
                      + readinessProbe = {
                          + failureThreshold    = (known after apply)
                          + initialDelaySeconds = (known after apply)
                          + periodSeconds       = (known after apply)
                          + successThreshold    = (known after apply)
                          + timeoutSeconds      = (known after apply)
                        }
                      + resources      = {
                          + claims   = (known after apply)
                          + limits   = (known after apply)
                          + requests = (known after apply)
                        }
                    }
                  + topicOperator = {
                      + image                          = (known after apply)
                      + jvmOptions                     = {
                          + "-XX"                = (known after apply)
                          + "-Xms"               = (known after apply)
                          + "-Xmx"               = (known after apply)
                          + gcLoggingEnabled     = (known after apply)
                          + javaSystemProperties = (known after apply)
                        }
                      + livenessProbe                  = {
                          + failureThreshold    = (known after apply)
                          + initialDelaySeconds = (known after apply)
                          + periodSeconds       = (known after apply)
                          + successThreshold    = (known after apply)
                          + timeoutSeconds      = (known after apply)
                        }
                      + logging                        = {
                          + loggers   = (known after apply)
                          + type      = (known after apply)
                          + valueFrom = {
                              + configMapKeyRef = {
                                  + key      = (known after apply)
                                  + name     = (known after apply)
                                  + optional = (known after apply)
                                }
                            }
                        }
                      + readinessProbe                 = {
                          + failureThreshold    = (known after apply)
                          + initialDelaySeconds = (known after apply)
                          + periodSeconds       = (known after apply)
                          + successThreshold    = (known after apply)
                          + timeoutSeconds      = (known after apply)
                        }
                      + reconciliationIntervalMs       = (known after apply)
                      + reconciliationIntervalSeconds  = (known after apply)
                      + resources                      = {
                          + claims   = (known after apply)
                          + limits   = (known after apply)
                          + requests = (known after apply)
                        }
                      + startupProbe                   = {
                          + failureThreshold    = (known after apply)
                          + initialDelaySeconds = (known after apply)
                          + periodSeconds       = (known after apply)
                          + successThreshold    = (known after apply)
                          + timeoutSeconds      = (known after apply)
                        }
                      + topicMetadataMaxAttempts       = (known after apply)
                      + watchedNamespace               = (known after apply)
                      + zookeeperSessionTimeoutSeconds = (known after apply)
                    }
                  + userOperator  = {
                      + image                          = (known after apply)
                      + jvmOptions                     = {
                          + "-XX"                = (known after apply)
                          + "-Xms"               = (known after apply)
                          + "-Xmx"               = (known after apply)
                          + gcLoggingEnabled     = (known after apply)
                          + javaSystemProperties = (known after apply)
                        }
                      + livenessProbe                  = {
                          + failureThreshold    = (known after apply)
                          + initialDelaySeconds = (known after apply)
                          + periodSeconds       = (known after apply)
                          + successThreshold    = (known after apply)
                          + timeoutSeconds      = (known after apply)
                        }
                      + logging                        = {
                          + loggers   = (known after apply)
                          + type      = (known after apply)
                          + valueFrom = {
                              + configMapKeyRef = {
                                  + key      = (known after apply)
                                  + name     = (known after apply)
                                  + optional = (known after apply)
                                }
                            }
                        }
                      + readinessProbe                 = {
                          + failureThreshold    = (known after apply)
                          + initialDelaySeconds = (known after apply)
                          + periodSeconds       = (known after apply)
                          + successThreshold    = (known after apply)
                          + timeoutSeconds      = (known after apply)
                        }
                      + reconciliationIntervalMs       = (known after apply)
                      + reconciliationIntervalSeconds  = (known after apply)
                      + resources                      = {
                          + claims   = (known after apply)
                          + limits   = (known after apply)
                          + requests = (known after apply)
                        }
                      + secretPrefix                   = (known after apply)
                      + watchedNamespace               = (known after apply)
                      + zookeeperSessionTimeoutSeconds = (known after apply)
                    }
                }
              + jmxTrans               = {
                  + image             = (known after apply)
                  + kafkaQueries      = (known after apply)
                  + logLevel          = (known after apply)
                  + outputDefinitions = (known after apply)
                  + resources         = {
                      + claims   = (known after apply)
                      + limits   = (known after apply)
                      + requests = (known after apply)
                    }
                  + template          = {
                      + container      = {
                          + env             = (known after apply)
                          + securityContext = {
                              + allowPrivilegeEscalation = (known after apply)
                              + appArmorProfile          = {
                                  + localhostProfile = (known after apply)
                                  + type             = (known after apply)
                                }
                              + capabilities             = {
                                  + add  = (known after apply)
                                  + drop = (known after apply)
                                }
                              + privileged               = (known after apply)
                              + procMount                = (known after apply)
                              + readOnlyRootFilesystem   = (known after apply)
                              + runAsGroup               = (known after apply)
                              + runAsNonRoot             = (known after apply)
                              + runAsUser                = (known after apply)
                              + seLinuxOptions           = {
                                  + level = (known after apply)
                                  + role  = (known after apply)
                                  + type  = (known after apply)
                                  + user  = (known after apply)
                                }
                              + seccompProfile           = {
                                  + localhostProfile = (known after apply)
                                  + type             = (known after apply)
                                }
                              + windowsOptions           = {
                                  + gmsaCredentialSpec     = (known after apply)
                                  + gmsaCredentialSpecName = (known after apply)
                                  + hostProcess            = (known after apply)
                                  + runAsUserName          = (known after apply)
                                }
                            }
                          + volumeMounts    = (known after apply)
                        }
                      + deployment     = {
                          + deploymentStrategy = (known after apply)
                          + metadata           = {
                              + annotations = (known after apply)
                              + labels      = (known after apply)
                            }
                        }
                      + pod            = {
                          + affinity                      = {
                              + nodeAffinity    = {
                                  + preferredDuringSchedulingIgnoredDuringExecution = (known after apply)
                                  + requiredDuringSchedulingIgnoredDuringExecution  = {
                                      + nodeSelectorTerms = (known after apply)
                                    }
                                }
                              + podAffinity     = {
                                  + preferredDuringSchedulingIgnoredDuringExecution = (known after apply)
                                  + requiredDuringSchedulingIgnoredDuringExecution  = (known after apply)
                                }
                              + podAntiAffinity = {
                                  + preferredDuringSchedulingIgnoredDuringExecution = (known after apply)
                                  + requiredDuringSchedulingIgnoredDuringExecution  = (known after apply)
                                }
                            }
                          + enableServiceLinks            = (known after apply)
                          + hostAliases                   = (known after apply)
                          + imagePullSecrets              = (known after apply)
                          + metadata                      = {
                              + annotations = (known after apply)
                              + labels      = (known after apply)
                            }
                          + priorityClassName             = (known after apply)
                          + schedulerName                 = (known after apply)
                          + securityContext               = {
                              + appArmorProfile     = {
                                  + localhostProfile = (known after apply)
                                  + type             = (known after apply)
                                }
                              + fsGroup             = (known after apply)
                              + fsGroupChangePolicy = (known after apply)
                              + runAsGroup          = (known after apply)
                              + runAsNonRoot        = (known after apply)
                              + runAsUser           = (known after apply)
                              + seLinuxOptions      = {
                                  + level = (known after apply)
                                  + role  = (known after apply)
                                  + type  = (known after apply)
                                  + user  = (known after apply)
                                }
                              + seccompProfile      = {
                                  + localhostProfile = (known after apply)
                                  + type             = (known after apply)
                                }
                              + supplementalGroups  = (known after apply)
                              + sysctls             = (known after apply)
                              + windowsOptions      = {
                                  + gmsaCredentialSpec     = (known after apply)
                                  + gmsaCredentialSpecName = (known after apply)
                                  + hostProcess            = (known after apply)
                                  + runAsUserName          = (known after apply)
                                }
                            }
                          + terminationGracePeriodSeconds = (known after apply)
                          + tmpDirSizeLimit               = (known after apply)
                          + tolerations                   = (known after apply)
                          + topologySpreadConstraints     = (known after apply)
                          + volumes                       = (known after apply)
                        }
                      + serviceAccount = {
                          + metadata = {
                              + annotations = (known after apply)
                              + labels      = (known after apply)
                            }
                        }
                    }
                }
              + kafka                  = {
                  + authorization       = {
                      + allowOnError                   = (known after apply)
                      + authorizerClass                = (known after apply)
                      + clientId                       = (known after apply)
                      + connectTimeoutSeconds          = (known after apply)
                      + delegateToKafkaAcls            = (known after apply)
                      + disableTlsHostnameVerification = (known after apply)
                      + enableMetrics                  = (known after apply)
                      + expireAfterMs                  = (known after apply)
                      + grantsAlwaysLatest             = (known after apply)
                      + grantsGcPeriodSeconds          = (known after apply)
                      + grantsMaxIdleTimeSeconds       = (known after apply)
                      + grantsRefreshPeriodSeconds     = (known after apply)
                      + grantsRefreshPoolSize          = (known after apply)
                      + httpRetries                    = (known after apply)
                      + includeAcceptHeader            = (known after apply)
                      + initialCacheCapacity           = (known after apply)
                      + maximumCacheSize               = (known after apply)
                      + readTimeoutSeconds             = (known after apply)
                      + superUsers                     = (known after apply)
                      + supportsAdminApi               = (known after apply)
                      + tlsTrustedCertificates         = (known after apply)
                      + tokenEndpointUri               = (known after apply)
                      + type                           = (known after apply)
                      + url                            = (known after apply)
                    }
                  + brokerRackInitImage = (known after apply)
                  + config              = {
                      + "default.replication.factor"               = 1
                      + "min.insync.replicas"                      = 1
                      + "offsets.topic.replication.factor"         = 1
                      + "transaction.state.log.min.isr"            = 1
                      + "transaction.state.log.replication.factor" = 1
                    }
                  + image               = (known after apply)
                  + jmxOptions          = {
                      + authentication = {
                          + type = (known after apply)
                        }
                    }
                  + jvmOptions          = {
                      + "-XX"                = (known after apply)
                      + "-Xms"               = (known after apply)
                      + "-Xmx"               = (known after apply)
                      + gcLoggingEnabled     = (known after apply)
                      + javaSystemProperties = (known after apply)
                    }
                  + listeners           = [
                      + {
                          + authentication     = {
                              + accessTokenIsJwt                  = (known after apply)
                              + checkAccessTokenType              = (known after apply)
                              + checkAudience                     = (known after apply)
                              + checkIssuer                       = (known after apply)
                              + clientAudience                    = (known after apply)
                              + clientId                          = (known after apply)
                              + clientScope                       = (known after apply)
                              + clientSecret                      = {
                                  + key        = (known after apply)
                                  + secretName = (known after apply)
                                }
                              + connectTimeoutSeconds             = (known after apply)
                              + customClaimCheck                  = (known after apply)
                              + disableTlsHostnameVerification    = (known after apply)
                              + enableECDSA                       = (known after apply)
                              + enableMetrics                     = (known after apply)
                              + enableOauthBearer                 = (known after apply)
                              + enablePlain                       = (known after apply)
                              + failFast                          = (known after apply)
                              + fallbackUserNameClaim             = (known after apply)
                              + fallbackUserNamePrefix            = (known after apply)
                              + groupsClaim                       = (known after apply)
                              + groupsClaimDelimiter              = (known after apply)
                              + httpRetries                       = (known after apply)
                              + httpRetryPauseMs                  = (known after apply)
                              + includeAcceptHeader               = (known after apply)
                              + introspectionEndpointUri          = (known after apply)
                              + jwksEndpointUri                   = (known after apply)
                              + jwksExpirySeconds                 = (known after apply)
                              + jwksIgnoreKeyUse                  = (known after apply)
                              + jwksMinRefreshPauseSeconds        = (known after apply)
                              + jwksRefreshSeconds                = (known after apply)
                              + listenerConfig                    = (known after apply)
                              + maxSecondsWithoutReauthentication = (known after apply)
                              + readTimeoutSeconds                = (known after apply)
                              + sasl                              = (known after apply)
                              + secrets                           = (known after apply)
                              + serverBearerTokenLocation         = (known after apply)
                              + tlsTrustedCertificates            = (known after apply)
                              + tokenEndpointUri                  = (known after apply)
                              + type                              = (known after apply)
                              + userInfoEndpointUri               = (known after apply)
                              + userNameClaim                     = (known after apply)
                              + userNamePrefix                    = (known after apply)
                              + validIssuerUri                    = (known after apply)
                              + validTokenType                    = (known after apply)
                            }
                          + configuration      = {
                              + advertisedHostTemplate        = (known after apply)
                              + allocateLoadBalancerNodePorts = (known after apply)
                              + bootstrap                     = {
                                  + alternativeNames = (known after apply)
                                  + annotations      = (known after apply)
                                  + externalIPs      = (known after apply)
                                  + host             = (known after apply)
                                  + labels           = (known after apply)
                                  + loadBalancerIP   = (known after apply)
                                  + nodePort         = (known after apply)
                                }
                              + brokerCertChainAndKey         = {
                                  + certificate = (known after apply)
                                  + key         = (known after apply)
                                  + secretName  = (known after apply)
                                }
                              + brokers                       = (known after apply)
                              + class                         = (known after apply)
                              + createBootstrapService        = (known after apply)
                              + externalTrafficPolicy         = (known after apply)
                              + finalizers                    = (known after apply)
                              + hostTemplate                  = (known after apply)
                              + ipFamilies                    = (known after apply)
                              + ipFamilyPolicy                = (known after apply)
                              + loadBalancerSourceRanges      = (known after apply)
                              + maxConnectionCreationRate     = (known after apply)
                              + maxConnections                = (known after apply)
                              + preferredNodePortAddressType  = (known after apply)
                              + publishNotReadyAddresses      = (known after apply)
                              + useServiceDnsDomain           = (known after apply)
                            }
                          + name               = "plain"
                          + networkPolicyPeers = (known after apply)
                          + port               = 9092
                          + tls                = false
                          + type               = "internal"
                        },
                      + {
                          + authentication     = {
                              + accessTokenIsJwt                  = (known after apply)
                              + checkAccessTokenType              = (known after apply)
                              + checkAudience                     = (known after apply)
                              + checkIssuer                       = (known after apply)
                              + clientAudience                    = (known after apply)
                              + clientId                          = (known after apply)
                              + clientScope                       = (known after apply)
                              + clientSecret                      = {
                                  + key        = (known after apply)
                                  + secretName = (known after apply)
                                }
                              + connectTimeoutSeconds             = (known after apply)
                              + customClaimCheck                  = (known after apply)
                              + disableTlsHostnameVerification    = (known after apply)
                              + enableECDSA                       = (known after apply)
                              + enableMetrics                     = (known after apply)
                              + enableOauthBearer                 = (known after apply)
                              + enablePlain                       = (known after apply)
                              + failFast                          = (known after apply)
                              + fallbackUserNameClaim             = (known after apply)
                              + fallbackUserNamePrefix            = (known after apply)
                              + groupsClaim                       = (known after apply)
                              + groupsClaimDelimiter              = (known after apply)
                              + httpRetries                       = (known after apply)
                              + httpRetryPauseMs                  = (known after apply)
                              + includeAcceptHeader               = (known after apply)
                              + introspectionEndpointUri          = (known after apply)
                              + jwksEndpointUri                   = (known after apply)
                              + jwksExpirySeconds                 = (known after apply)
                              + jwksIgnoreKeyUse                  = (known after apply)
                              + jwksMinRefreshPauseSeconds        = (known after apply)
                              + jwksRefreshSeconds                = (known after apply)
                              + listenerConfig                    = (known after apply)
                              + maxSecondsWithoutReauthentication = (known after apply)
                              + readTimeoutSeconds                = (known after apply)
                              + sasl                              = (known after apply)
                              + secrets                           = (known after apply)
                              + serverBearerTokenLocation         = (known after apply)
                              + tlsTrustedCertificates            = (known after apply)
                              + tokenEndpointUri                  = (known after apply)
                              + type                              = "tls"
                              + userInfoEndpointUri               = (known after apply)
                              + userNameClaim                     = (known after apply)
                              + userNamePrefix                    = (known after apply)
                              + validIssuerUri                    = (known after apply)
                              + validTokenType                    = (known after apply)
                            }
                          + configuration      = {
                              + advertisedHostTemplate        = (known after apply)
                              + allocateLoadBalancerNodePorts = (known after apply)
                              + bootstrap                     = {
                                  + alternativeNames = (known after apply)
                                  + annotations      = (known after apply)
                                  + externalIPs      = (known after apply)
                                  + host             = (known after apply)
                                  + labels           = (known after apply)
                                  + loadBalancerIP   = (known after apply)
                                  + nodePort         = (known after apply)
                                }
                              + brokerCertChainAndKey         = {
                                  + certificate = (known after apply)
                                  + key         = (known after apply)
                                  + secretName  = (known after apply)
                                }
                              + brokers                       = (known after apply)
                              + class                         = (known after apply)
                              + createBootstrapService        = (known after apply)
                              + externalTrafficPolicy         = (known after apply)
                              + finalizers                    = (known after apply)
                              + hostTemplate                  = (known after apply)
                              + ipFamilies                    = (known after apply)
                              + ipFamilyPolicy                = (known after apply)
                              + loadBalancerSourceRanges      = (known after apply)
                              + maxConnectionCreationRate     = (known after apply)
                              + maxConnections                = (known after apply)
                              + preferredNodePortAddressType  = (known after apply)
                              + publishNotReadyAddresses      = (known after apply)
                              + useServiceDnsDomain           = (known after apply)
                            }
                          + name               = "tls"
                          + networkPolicyPeers = (known after apply)
                          + port               = 9093
                          + tls                = true
                          + type               = "internal"
                        },
                      + {
                          + authentication     = {
                              + accessTokenIsJwt                  = (known after apply)
                              + checkAccessTokenType              = (known after apply)
                              + checkAudience                     = (known after apply)
                              + checkIssuer                       = (known after apply)
                              + clientAudience                    = (known after apply)
                              + clientId                          = (known after apply)
                              + clientScope                       = (known after apply)
                              + clientSecret                      = {
                                  + key        = (known after apply)
                                  + secretName = (known after apply)
                                }
                              + connectTimeoutSeconds             = (known after apply)
                              + customClaimCheck                  = (known after apply)
                              + disableTlsHostnameVerification    = (known after apply)
                              + enableECDSA                       = (known after apply)
                              + enableMetrics                     = (known after apply)
                              + enableOauthBearer                 = (known after apply)
                              + enablePlain                       = (known after apply)
                              + failFast                          = (known after apply)
                              + fallbackUserNameClaim             = (known after apply)
                              + fallbackUserNamePrefix            = (known after apply)
                              + groupsClaim                       = (known after apply)
                              + groupsClaimDelimiter              = (known after apply)
                              + httpRetries                       = (known after apply)
                              + httpRetryPauseMs                  = (known after apply)
                              + includeAcceptHeader               = (known after apply)
                              + introspectionEndpointUri          = (known after apply)
                              + jwksEndpointUri                   = (known after apply)
                              + jwksExpirySeconds                 = (known after apply)
                              + jwksIgnoreKeyUse                  = (known after apply)
                              + jwksMinRefreshPauseSeconds        = (known after apply)
                              + jwksRefreshSeconds                = (known after apply)
                              + listenerConfig                    = (known after apply)
                              + maxSecondsWithoutReauthentication = (known after apply)
                              + readTimeoutSeconds                = (known after apply)
                              + sasl                              = (known after apply)
                              + secrets                           = (known after apply)
                              + serverBearerTokenLocation         = (known after apply)
                              + tlsTrustedCertificates            = (known after apply)
                              + tokenEndpointUri                  = (known after apply)
                              + type                              = (known after apply)
                              + userInfoEndpointUri               = (known after apply)
                              + userNameClaim                     = (known after apply)
                              + userNamePrefix                    = (known after apply)
                              + validIssuerUri                    = (known after apply)
                              + validTokenType                    = (known after apply)
                            }
                          + configuration      = {
                              + advertisedHostTemplate        = (known after apply)
                              + allocateLoadBalancerNodePorts = (known after apply)
                              + bootstrap                     = {
                                  + alternativeNames = (known after apply)
                                  + annotations      = (known after apply)
                                  + externalIPs      = (known after apply)
                                  + host             = (known after apply)
                                  + labels           = (known after apply)
                                  + loadBalancerIP   = (known after apply)
                                  + nodePort         = (known after apply)
                                }
                              + brokerCertChainAndKey         = {
                                  + certificate = (known after apply)
                                  + key         = (known after apply)
                                  + secretName  = (known after apply)
                                }
                              + brokers                       = (known after apply)
                              + class                         = (known after apply)
                              + createBootstrapService        = (known after apply)
                              + externalTrafficPolicy         = (known after apply)
                              + finalizers                    = (known after apply)
                              + hostTemplate                  = (known after apply)
                              + ipFamilies                    = (known after apply)
                              + ipFamilyPolicy                = (known after apply)
                              + loadBalancerSourceRanges      = (known after apply)
                              + maxConnectionCreationRate     = (known after apply)
                              + maxConnections                = (known after apply)
                              + preferredNodePortAddressType  = (known after apply)
                              + publishNotReadyAddresses      = (known after apply)
                              + useServiceDnsDomain           = (known after apply)
                            }
                          + name               = "external"
                          + networkPolicyPeers = (known after apply)
                          + port               = 9094
                          + tls                = false
                          + type               = "nodeport"
                        },
                    ]
                  + livenessProbe       = {
                      + failureThreshold    = (known after apply)
                      + initialDelaySeconds = (known after apply)
                      + periodSeconds       = (known after apply)
                      + successThreshold    = (known after apply)
                      + timeoutSeconds      = (known after apply)
                    }
                  + logging             = {
                      + loggers   = (known after apply)
                      + type      = (known after apply)
                      + valueFrom = {
                          + configMapKeyRef = {
                              + key      = (known after apply)
                              + name     = (known after apply)
                              + optional = (known after apply)
                            }
                        }
                    }
                  + metadataVersion     = (known after apply)
                  + metricsConfig       = {
                      + type      = (known after apply)
                      + valueFrom = {
                          + configMapKeyRef = {
                              + key      = (known after apply)
                              + name     = (known after apply)
                              + optional = (known after apply)
                            }
                        }
                    }
                  + quotas              = {
                      + consumerByteRate           = (known after apply)
                      + controllerMutationRate     = (known after apply)
                      + excludedPrincipals         = (known after apply)
                      + minAvailableBytesPerVolume = (known after apply)
                      + minAvailableRatioPerVolume = (known after apply)
                      + producerByteRate           = (known after apply)
                      + requestPercentage          = (known after apply)
                      + type                       = (known after apply)
                    }
                  + rack                = {
                      + topologyKey = (known after apply)
                    }
                  + readinessProbe      = {
                      + failureThreshold    = (known after apply)
                      + initialDelaySeconds = (known after apply)
                      + periodSeconds       = (known after apply)
                      + successThreshold    = (known after apply)
                      + timeoutSeconds      = (known after apply)
                    }
                  + replicas            = 1
                  + resources           = {
                      + claims   = (known after apply)
                      + limits   = (known after apply)
                      + requests = (known after apply)
                    }
                  + storage             = {
                      + class         = (known after apply)
                      + deleteClaim   = (known after apply)
                      + id            = (known after apply)
                      + kraftMetadata = (known after apply)
                      + overrides     = (known after apply)
                      + selector      = (known after apply)
                      + size          = (known after apply)
                      + sizeLimit     = (known after apply)
                      + type          = "jbod"
                      + volumes       = [
                          + {
                              + class         = (known after apply)
                              + deleteClaim   = false
                              + id            = 0
                              + kraftMetadata = (known after apply)
                              + overrides     = (known after apply)
                              + selector      = (known after apply)
                              + size          = "8Gi"
                              + sizeLimit     = (known after apply)
                              + type          = "persistent-claim"
                            },
                        ]
                    }
                  + template            = {
                      + bootstrapService         = {
                          + ipFamilies     = (known after apply)
                          + ipFamilyPolicy = (known after apply)
                          + metadata       = {
                              + annotations = (known after apply)
                              + labels      = (known after apply)
                            }
                        }
                      + brokersService           = {
                          + ipFamilies     = (known after apply)
                          + ipFamilyPolicy = (known after apply)
                          + metadata       = {
                              + annotations = (known after apply)
                              + labels      = (known after apply)
                            }
                        }
                      + clusterCaCert            = {
                          + metadata = {
                              + annotations = (known after apply)
                              + labels      = (known after apply)
                            }
                        }
                      + clusterRoleBinding       = {
                          + metadata = {
                              + annotations = (known after apply)
                              + labels      = (known after apply)
                            }
                        }
                      + externalBootstrapIngress = {
                          + metadata = {
                              + annotations = (known after apply)
                              + labels      = (known after apply)
                            }
                        }
                      + externalBootstrapRoute   = {
                          + metadata = {
                              + annotations = (known after apply)
                              + labels      = (known after apply)
                            }
                        }
                      + externalBootstrapService = {
                          + metadata = {
                              + annotations = (known after apply)
                              + labels      = (known after apply)
                            }
                        }
                      + initContainer            = {
                          + env             = (known after apply)
                          + securityContext = {
                              + allowPrivilegeEscalation = (known after apply)
                              + appArmorProfile          = {
                                  + localhostProfile = (known after apply)
                                  + type             = (known after apply)
                                }
                              + capabilities             = {
                                  + add  = (known after apply)
                                  + drop = (known after apply)
                                }
                              + privileged               = (known after apply)
                              + procMount                = (known after apply)
                              + readOnlyRootFilesystem   = (known after apply)
                              + runAsGroup               = (known after apply)
                              + runAsNonRoot             = (known after apply)
                              + runAsUser                = (known after apply)
                              + seLinuxOptions           = {
                                  + level = (known after apply)
                                  + role  = (known after apply)
                                  + type  = (known after apply)
                                  + user  = (known after apply)
                                }
                              + seccompProfile           = {
                                  + localhostProfile = (known after apply)
                                  + type             = (known after apply)
                                }
                              + windowsOptions           = {
                                  + gmsaCredentialSpec     = (known after apply)
                                  + gmsaCredentialSpecName = (known after apply)
                                  + hostProcess            = (known after apply)
                                  + runAsUserName          = (known after apply)
                                }
                            }
                          + volumeMounts    = (known after apply)
                        }
                      + jmxSecret                = {
                          + metadata = {
                              + annotations = (known after apply)
                              + labels      = (known after apply)
                            }
                        }
                      + kafkaContainer           = {
                          + env             = (known after apply)
                          + securityContext = {
                              + allowPrivilegeEscalation = (known after apply)
                              + appArmorProfile          = {
                                  + localhostProfile = (known after apply)
                                  + type             = (known after apply)
                                }
                              + capabilities             = {
                                  + add  = (known after apply)
                                  + drop = (known after apply)
                                }
                              + privileged               = (known after apply)
                              + procMount                = (known after apply)
                              + readOnlyRootFilesystem   = (known after apply)
                              + runAsGroup               = (known after apply)
                              + runAsNonRoot             = (known after apply)
                              + runAsUser                = (known after apply)
                              + seLinuxOptions           = {
                                  + level = (known after apply)
                                  + role  = (known after apply)
                                  + type  = (known after apply)
                                  + user  = (known after apply)
                                }
                              + seccompProfile           = {
                                  + localhostProfile = (known after apply)
                                  + type             = (known after apply)
                                }
                              + windowsOptions           = {
                                  + gmsaCredentialSpec     = (known after apply)
                                  + gmsaCredentialSpecName = (known after apply)
                                  + hostProcess            = (known after apply)
                                  + runAsUserName          = (known after apply)
                                }
                            }
                          + volumeMounts    = (known after apply)
                        }
                      + perPodIngress            = {
                          + metadata = {
                              + annotations = (known after apply)
                              + labels      = (known after apply)
                            }
                        }
                      + perPodRoute              = {
                          + metadata = {
                              + annotations = (known after apply)
                              + labels      = (known after apply)
                            }
                        }
                      + perPodService            = {
                          + metadata = {
                              + annotations = (known after apply)
                              + labels      = (known after apply)
                            }
                        }
                      + persistentVolumeClaim    = {
                          + metadata = {
                              + annotations = (known after apply)
                              + labels      = (known after apply)
                            }
                        }
                      + pod                      = {
                          + affinity                      = {
                              + nodeAffinity    = {
                                  + preferredDuringSchedulingIgnoredDuringExecution = (known after apply)
                                  + requiredDuringSchedulingIgnoredDuringExecution  = {
                                      + nodeSelectorTerms = (known after apply)
                                    }
                                }
                              + podAffinity     = {
                                  + preferredDuringSchedulingIgnoredDuringExecution = (known after apply)
                                  + requiredDuringSchedulingIgnoredDuringExecution  = (known after apply)
                                }
                              + podAntiAffinity = {
                                  + preferredDuringSchedulingIgnoredDuringExecution = (known after apply)
                                  + requiredDuringSchedulingIgnoredDuringExecution  = (known after apply)
                                }
                            }
                          + enableServiceLinks            = (known after apply)
                          + hostAliases                   = (known after apply)
                          + imagePullSecrets              = (known after apply)
                          + metadata                      = {
                              + annotations = (known after apply)
                              + labels      = (known after apply)
                            }
                          + priorityClassName             = (known after apply)
                          + schedulerName                 = (known after apply)
                          + securityContext               = {
                              + appArmorProfile     = {
                                  + localhostProfile = (known after apply)
                                  + type             = (known after apply)
                                }
                              + fsGroup             = (known after apply)
                              + fsGroupChangePolicy = (known after apply)
                              + runAsGroup          = (known after apply)
                              + runAsNonRoot        = (known after apply)
                              + runAsUser           = (known after apply)
                              + seLinuxOptions      = {
                                  + level = (known after apply)
                                  + role  = (known after apply)
                                  + type  = (known after apply)
                                  + user  = (known after apply)
                                }
                              + seccompProfile      = {
                                  + localhostProfile = (known after apply)
                                  + type             = (known after apply)
                                }
                              + supplementalGroups  = (known after apply)
                              + sysctls             = (known after apply)
                              + windowsOptions      = {
                                  + gmsaCredentialSpec     = (known after apply)
                                  + gmsaCredentialSpecName = (known after apply)
                                  + hostProcess            = (known after apply)
                                  + runAsUserName          = (known after apply)
                                }
                            }
                          + terminationGracePeriodSeconds = (known after apply)
                          + tmpDirSizeLimit               = (known after apply)
                          + tolerations                   = (known after apply)
                          + topologySpreadConstraints     = (known after apply)
                          + volumes                       = (known after apply)
                        }
                      + podDisruptionBudget      = {
                          + maxUnavailable = (known after apply)
                          + metadata       = {
                              + annotations = (known after apply)
                              + labels      = (known after apply)
                            }
                        }
                      + podSet                   = {
                          + metadata = {
                              + annotations = (known after apply)
                              + labels      = (known after apply)
                            }
                        }
                      + serviceAccount           = {
                          + metadata = {
                              + annotations = (known after apply)
                              + labels      = (known after apply)
                            }
                        }
                      + statefulset              = {
                          + metadata            = {
                              + annotations = (known after apply)
                              + labels      = (known after apply)
                            }
                          + podManagementPolicy = (known after apply)
                        }
                    }
                  + tieredStorage       = {
                      + remoteStorageManager = {
                          + className = (known after apply)
                          + classPath = (known after apply)
                          + config    = (known after apply)
                        }
                      + type                 = (known after apply)
                    }
                  + version             = (known after apply)
                }
              + kafkaExporter          = {
                  + enableSaramaLogging = (known after apply)
                  + groupExcludeRegex   = (known after apply)
                  + groupRegex          = (known after apply)
                  + image               = (known after apply)
                  + livenessProbe       = {
                      + failureThreshold    = (known after apply)
                      + initialDelaySeconds = (known after apply)
                      + periodSeconds       = (known after apply)
                      + successThreshold    = (known after apply)
                      + timeoutSeconds      = (known after apply)
                    }
                  + logging             = (known after apply)
                  + readinessProbe      = {
                      + failureThreshold    = (known after apply)
                      + initialDelaySeconds = (known after apply)
                      + periodSeconds       = (known after apply)
                      + successThreshold    = (known after apply)
                      + timeoutSeconds      = (known after apply)
                    }
                  + resources           = {
                      + claims   = (known after apply)
                      + limits   = (known after apply)
                      + requests = (known after apply)
                    }
                  + showAllOffsets      = (known after apply)
                  + template            = {
                      + container      = {
                          + env             = (known after apply)
                          + securityContext = {
                              + allowPrivilegeEscalation = (known after apply)
                              + appArmorProfile          = {
                                  + localhostProfile = (known after apply)
                                  + type             = (known after apply)
                                }
                              + capabilities             = {
                                  + add  = (known after apply)
                                  + drop = (known after apply)
                                }
                              + privileged               = (known after apply)
                              + procMount                = (known after apply)
                              + readOnlyRootFilesystem   = (known after apply)
                              + runAsGroup               = (known after apply)
                              + runAsNonRoot             = (known after apply)
                              + runAsUser                = (known after apply)
                              + seLinuxOptions           = {
                                  + level = (known after apply)
                                  + role  = (known after apply)
                                  + type  = (known after apply)
                                  + user  = (known after apply)
                                }
                              + seccompProfile           = {
                                  + localhostProfile = (known after apply)
                                  + type             = (known after apply)
                                }
                              + windowsOptions           = {
                                  + gmsaCredentialSpec     = (known after apply)
                                  + gmsaCredentialSpecName = (known after apply)
                                  + hostProcess            = (known after apply)
                                  + runAsUserName          = (known after apply)
                                }
                            }
                          + volumeMounts    = (known after apply)
                        }
                      + deployment     = {
                          + deploymentStrategy = (known after apply)
                          + metadata           = {
                              + annotations = (known after apply)
                              + labels      = (known after apply)
                            }
                        }
                      + pod            = {
                          + affinity                      = {
                              + nodeAffinity    = {
                                  + preferredDuringSchedulingIgnoredDuringExecution = (known after apply)
                                  + requiredDuringSchedulingIgnoredDuringExecution  = {
                                      + nodeSelectorTerms = (known after apply)
                                    }
                                }
                              + podAffinity     = {
                                  + preferredDuringSchedulingIgnoredDuringExecution = (known after apply)
                                  + requiredDuringSchedulingIgnoredDuringExecution  = (known after apply)
                                }
                              + podAntiAffinity = {
                                  + preferredDuringSchedulingIgnoredDuringExecution = (known after apply)
                                  + requiredDuringSchedulingIgnoredDuringExecution  = (known after apply)
                                }
                            }
                          + enableServiceLinks            = (known after apply)
                          + hostAliases                   = (known after apply)
                          + imagePullSecrets              = (known after apply)
                          + metadata                      = {
                              + annotations = (known after apply)
                              + labels      = (known after apply)
                            }
                          + priorityClassName             = (known after apply)
                          + schedulerName                 = (known after apply)
                          + securityContext               = {
                              + appArmorProfile     = {
                                  + localhostProfile = (known after apply)
                                  + type             = (known after apply)
                                }
                              + fsGroup             = (known after apply)
                              + fsGroupChangePolicy = (known after apply)
                              + runAsGroup          = (known after apply)
                              + runAsNonRoot        = (known after apply)
                              + runAsUser           = (known after apply)
                              + seLinuxOptions      = {
                                  + level = (known after apply)
                                  + role  = (known after apply)
                                  + type  = (known after apply)
                                  + user  = (known after apply)
                                }
                              + seccompProfile      = {
                                  + localhostProfile = (known after apply)
                                  + type             = (known after apply)
                                }
                              + supplementalGroups  = (known after apply)
                              + sysctls             = (known after apply)
                              + windowsOptions      = {
                                  + gmsaCredentialSpec     = (known after apply)
                                  + gmsaCredentialSpecName = (known after apply)
                                  + hostProcess            = (known after apply)
                                  + runAsUserName          = (known after apply)
                                }
                            }
                          + terminationGracePeriodSeconds = (known after apply)
                          + tmpDirSizeLimit               = (known after apply)
                          + tolerations                   = (known after apply)
                          + topologySpreadConstraints     = (known after apply)
                          + volumes                       = (known after apply)
                        }
                      + service        = {
                          + metadata = {
                              + annotations = (known after apply)
                              + labels      = (known after apply)
                            }
                        }
                      + serviceAccount = {
                          + metadata = {
                              + annotations = (known after apply)
                              + labels      = (known after apply)
                            }
                        }
                    }
                  + topicExcludeRegex   = (known after apply)
                  + topicRegex          = (known after apply)
                }
              + maintenanceTimeWindows = (known after apply)
              + zookeeper              = {
                  + config         = (known after apply)
                  + image          = (known after apply)
                  + jmxOptions     = {
                      + authentication = {
                          + type = (known after apply)
                        }
                    }
                  + jvmOptions     = {
                      + "-XX"                = (known after apply)
                      + "-Xms"               = (known after apply)
                      + "-Xmx"               = (known after apply)
                      + gcLoggingEnabled     = (known after apply)
                      + javaSystemProperties = (known after apply)
                    }
                  + livenessProbe  = {
                      + failureThreshold    = (known after apply)
                      + initialDelaySeconds = (known after apply)
                      + periodSeconds       = (known after apply)
                      + successThreshold    = (known after apply)
                      + timeoutSeconds      = (known after apply)
                    }
                  + logging        = {
                      + loggers   = (known after apply)
                      + type      = (known after apply)
                      + valueFrom = {
                          + configMapKeyRef = {
                              + key      = (known after apply)
                              + name     = (known after apply)
                              + optional = (known after apply)
                            }
                        }
                    }
                  + metricsConfig  = {
                      + type      = (known after apply)
                      + valueFrom = {
                          + configMapKeyRef = {
                              + key      = (known after apply)
                              + name     = (known after apply)
                              + optional = (known after apply)
                            }
                        }
                    }
                  + readinessProbe = {
                      + failureThreshold    = (known after apply)
                      + initialDelaySeconds = (known after apply)
                      + periodSeconds       = (known after apply)
                      + successThreshold    = (known after apply)
                      + timeoutSeconds      = (known after apply)
                    }
                  + replicas       = 1
                  + resources      = {
                      + claims   = (known after apply)
                      + limits   = (known after apply)
                      + requests = (known after apply)
                    }
                  + storage        = {
                      + class         = (known after apply)
                      + deleteClaim   = false
                      + id            = (known after apply)
                      + kraftMetadata = (known after apply)
                      + overrides     = (known after apply)
                      + selector      = (known after apply)
                      + size          = "8Gi"
                      + sizeLimit     = (known after apply)
                      + type          = "persistent-claim"
                    }
                  + template       = {
                      + clientService         = {
                          + ipFamilies     = (known after apply)
                          + ipFamilyPolicy = (known after apply)
                          + metadata       = {
                              + annotations = (known after apply)
                              + labels      = (known after apply)
                            }
                        }
                      + jmxSecret             = {
                          + metadata = {
                              + annotations = (known after apply)
                              + labels      = (known after apply)
                            }
                        }
                      + nodesService          = {
                          + ipFamilies     = (known after apply)
                          + ipFamilyPolicy = (known after apply)
                          + metadata       = {
                              + annotations = (known after apply)
                              + labels      = (known after apply)
                            }
                        }
                      + persistentVolumeClaim = {
                          + metadata = {
                              + annotations = (known after apply)
                              + labels      = (known after apply)
                            }
                        }
                      + pod                   = {
                          + affinity                      = {
                              + nodeAffinity    = {
                                  + preferredDuringSchedulingIgnoredDuringExecution = (known after apply)
                                  + requiredDuringSchedulingIgnoredDuringExecution  = {
                                      + nodeSelectorTerms = (known after apply)
                                    }
                                }
                              + podAffinity     = {
                                  + preferredDuringSchedulingIgnoredDuringExecution = (known after apply)
                                  + requiredDuringSchedulingIgnoredDuringExecution  = (known after apply)
                                }
                              + podAntiAffinity = {
                                  + preferredDuringSchedulingIgnoredDuringExecution = (known after apply)
                                  + requiredDuringSchedulingIgnoredDuringExecution  = (known after apply)
                                }
                            }
                          + enableServiceLinks            = (known after apply)
                          + hostAliases                   = (known after apply)
                          + imagePullSecrets              = (known after apply)
                          + metadata                      = {
                              + annotations = (known after apply)
                              + labels      = (known after apply)
                            }
                          + priorityClassName             = (known after apply)
                          + schedulerName                 = (known after apply)
                          + securityContext               = {
                              + appArmorProfile     = {
                                  + localhostProfile = (known after apply)
                                  + type             = (known after apply)
                                }
                              + fsGroup             = (known after apply)
                              + fsGroupChangePolicy = (known after apply)
                              + runAsGroup          = (known after apply)
                              + runAsNonRoot        = (known after apply)
                              + runAsUser           = (known after apply)
                              + seLinuxOptions      = {
                                  + level = (known after apply)
                                  + role  = (known after apply)
                                  + type  = (known after apply)
                                  + user  = (known after apply)
                                }
                              + seccompProfile      = {
                                  + localhostProfile = (known after apply)
                                  + type             = (known after apply)
                                }
                              + supplementalGroups  = (known after apply)
                              + sysctls             = (known after apply)
                              + windowsOptions      = {
                                  + gmsaCredentialSpec     = (known after apply)
                                  + gmsaCredentialSpecName = (known after apply)
                                  + hostProcess            = (known after apply)
                                  + runAsUserName          = (known after apply)
                                }
                            }
                          + terminationGracePeriodSeconds = (known after apply)
                          + tmpDirSizeLimit               = (known after apply)
                          + tolerations                   = (known after apply)
                          + topologySpreadConstraints     = (known after apply)
                          + volumes                       = (known after apply)
                        }
                      + podDisruptionBudget   = {
                          + maxUnavailable = (known after apply)
                          + metadata       = {
                              + annotations = (known after apply)
                              + labels      = (known after apply)
                            }
                        }
                      + podSet                = {
                          + metadata = {
                              + annotations = (known after apply)
                              + labels      = (known after apply)
                            }
                        }
                      + serviceAccount        = {
                          + metadata = {
                              + annotations = (known after apply)
                              + labels      = (known after apply)
                            }
                        }
                      + statefulset           = {
                          + metadata            = {
                              + annotations = (known after apply)
                              + labels      = (known after apply)
                            }
                          + podManagementPolicy = (known after apply)
                        }
                      + zookeeperContainer    = {
                          + env             = (known after apply)
                          + securityContext = {
                              + allowPrivilegeEscalation = (known after apply)
                              + appArmorProfile          = {
                                  + localhostProfile = (known after apply)
                                  + type             = (known after apply)
                                }
                              + capabilities             = {
                                  + add  = (known after apply)
                                  + drop = (known after apply)
                                }
                              + privileged               = (known after apply)
                              + procMount                = (known after apply)
                              + readOnlyRootFilesystem   = (known after apply)
                              + runAsGroup               = (known after apply)
                              + runAsNonRoot             = (known after apply)
                              + runAsUser                = (known after apply)
                              + seLinuxOptions           = {
                                  + level = (known after apply)
                                  + role  = (known after apply)
                                  + type  = (known after apply)
                                  + user  = (known after apply)
                                }
                              + seccompProfile           = {
                                  + localhostProfile = (known after apply)
                                  + type             = (known after apply)
                                }
                              + windowsOptions           = {
                                  + gmsaCredentialSpec     = (known after apply)
                                  + gmsaCredentialSpecName = (known after apply)
                                  + hostProcess            = (known after apply)
                                  + runAsUserName          = (known after apply)
                                }
                            }
                          + volumeMounts    = (known after apply)
                        }
                    }
                }
            }
        }
    }

  # kubernetes_namespace.kafka_debezium_cluster will be created
  + resource "kubernetes_namespace" "kafka_debezium_cluster" {
      + id                               = (known after apply)
      + wait_for_default_service_account = false

      + metadata {
          + generation       = (known after apply)
          + name             = "kafka"
          + resource_version = (known after apply)
          + uid              = (known after apply)
        }
    }

  # module.eks.module.kms.aws_kms_key.this[0] will be updated in-place
  ~ resource "aws_kms_key" "this" {
        id                                 = "02e10580-78ff-4a65-be74-445b1cf24ce2"
      ~ policy                             = jsonencode(
          ~ {
              ~ Statement = [
                    {
                        Action    = "kms:*"
                        Effect    = "Allow"
                        Principal = {
                            AWS = "arn:aws:iam::183631350996:root"
                        }
                        Resource  = "*"
                        Sid       = "Default"
                    },
                  ~ {
                      ~ Principal = {
                          ~ AWS = "arn:aws:iam::183631350996:role/IaC" -> "arn:aws:iam::183631350996:role/IaC-ReadOnly"
                        }
                        # (4 unchanged attributes hidden)
                    },
                    {
                        Action    = [
                            "kms:ReEncrypt*",
                            "kms:GenerateDataKey*",
                            "kms:Encrypt",
                            "kms:DescribeKey",
                            "kms:Decrypt",
                        ]
                        Effect    = "Allow"
                        Principal = {
                            AWS = "arn:aws:iam::183631350996:role/common-eks-cluster-20241226043235471800000001"
                        }
                        Resource  = "*"
                        Sid       = "KeyUsage"
                    },
                ]
                # (1 unchanged attribute hidden)
            }
        )
        tags                               = {
            "terraform-aws-modules" = "eks"
        }
        # (13 unchanged attributes hidden)
    }

Plan: 2 to add, 1 to change, 0 to destroy.

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.

```

</details>

*Pusher: @yashrajdighe, Action: `pull_request`, Working Directory: ``, Workflow: `terraform-plan`*